Repository: Richasy/FantasyCopilot
Catalog: src/App/Resources/Strings/*/Resources.resw
Source language: en_us
Languages: zh_cn

# OpenPluginFolder
source: Open plugin directory
zh_cn: 打开插件目录

source: Open repository
zh_cn: 打开存储库

source: Other
zh_cn: 其它

source: Plugins
zh_cn: 插件

source: Tool
zh_cn: 工具

# InvalidStepRemoved
source: Temporarily removed invalid steps, please reconfigure in the editor
zh_cn: 已暂时移除无效的步骤，请在编辑器中重新配置

# NoStepError
source: No steps to execute
zh_cn: 没有可以执行的步骤

# ChangeFolder
source: Change the folder
zh_cn: 更改文件夹

# OpenConsoleWhenPluginRunning
source: Show console when plugin command runs
zh_cn: 插件命令运行时显示控制台

source: Open folder
zh_cn: 打开文件夹

source: Plugin Folder
zh_cn: 插件目录

# WorkflowOption
source: Workflow configuration
zh_cn: 工作流配置

# WorkflowOptionDescription
source: Configuration items related to workflow
zh_cn: 工作流相关的配置项

# CanNotSelectSameFolder
source: You cannot select the same folder
zh_cn: 不能选择同一文件夹

source: Move completed
zh_cn: 已经移动完成

source: Embedding model endpoint
zh_cn: 嵌入模型终结点

# OptionalOrganization
source: Organization (optional)
zh_cn: 组织（选填）

# OrganizationPlaceholderText
source: Fill in organization name
zh_cn: 填写组织名称

source: Text completion model endpoint
zh_cn: 文本完成模型终结点

# AddImageSkill
source: Add drawing skill
zh_cn: 添加绘图技能

# DeleteImageSkill
source: Delete Drawing Skill
zh_cn: 删除绘图技能

# DeleteImageSkillTip
source: After deleting a drawing skill, the workflows referencing the skill need to be reconfigured, do you want to confirm?
zh_cn: 删除绘图技能后，引用该技能的工作流需要重新配置，是否确认？

# ImageSkill
source: Drawing Skills
zh_cn: 绘图技能

# ImageSkillEditor
source: Drawing skill editor
zh_cn: 绘图技能编辑

# NoImageSkill
source: No Drawing Skills
zh_cn: 没有绘图技能

# NoImageSkillDescription
source: Please create a new drawing skill
zh_cn: 请创建一个新的绘图技能

source: Open image
zh_cn: 打开图片

# OutputImage
source: Image Output
zh_cn: 图片输出

# OutputImageDescription
source: Display the image according to the incoming link/path
zh_cn: 根据传入的链接/路径显示图片

source: Import file to knowledge base
zh_cn: 将文件导入知识库

source: Import folder to knowledge base
zh_cn: 将文件夹导入知识库

source: Knowledge Base Q&A
zh_cn: 知识库问答

# ClickInput
source: Click
zh_cn: 点击

# ClickInputDescription
source: Click to trigger and do not pass in text content
zh_cn: 单击触发，不传入文本内容

source: Variable name
zh_cn: 变量名

source: Variable redirect
zh_cn: 变量重定向

source: Text notification
zh_cn: 文本通知

# TextNotificationDescription
source: Send a plain text system notification
zh_cn: 发送一条纯文本系统通知

# VerifyIdentity
source: You need to verify your identity
zh_cn: 需要验证你的身份

# CancelBecauseNotVerified
source: The operation was canceled because your identity could not be verified
zh_cn: 已取消操作，因为无法验证你的身份

# AppLog
source: Application logs
zh_cn: 应用日志

# AppLogDescription
source: Application log-related configuration items
zh_cn: 应用日志相关的配置项

source: Open log folder
zh_cn: 打开日志文件夹

source: Create variable
zh_cn: 创建变量

source: Value
zh_cn: 值

source: Knowledge base settings
zh_cn: 知识库设置

# KnowledgeBaseSettingsDescription
source: Knowledge base-related configuration items
zh_cn: 知识库相关的配置项

# RepositoryLink
source: Github Repository
zh_cn: Github 仓库

source: App Id
zh_cn: 应用 ID

# AppIdPlaceholderText
source: Please enter the app id
zh_cn: 请输入 App ID

source: App key
zh_cn: 应用密钥

# AppKeyPlaceholderText
source: Please enter the app key
zh_cn: 请输入应用密钥

# BaiduTranslate
source: Baidu Translate Service
zh_cn: 百度翻译

# TranslateOptions
source: Translation configuration
zh_cn: 翻译服务配置

# TranslateOptionsDescription
source: Configuration options for text translation
zh_cn: 文本翻译的配置项

source: Stream Output
zh_cn: 流式输出

# StreamOutputDescription
source: Get the response of the LLM by paragraph
zh_cn: 逐句逐段获取语言模型的响应

source: Auto Remove Earlier Message
zh_cn: 自动移除早期消息

# AutoRemoveEarlierMessageDescription
source: When the token limit is reached, earlier messages are removed to continue the conversation
zh_cn: 达到令牌上限时，将移除较早的消息以继续对话

# ProxyEndpoint
source: Proxy endpoint (optional)
zh_cn: 代理终结点（选填）

# ProxyWarning
source: Please verify whether the proxy service is trustworthy
zh_cn: 请自行验证代理服务是否可信

source: Context limit
zh_cn: 上下文个数

# ContextLimitDescription
source: How many contexts to return at most
zh_cn: 最多返回多少个上下文

source: Min relevance score
zh_cn: 最小相关度

# MinRelevanceScoreDescription
source: Acceptable minimum correlation
zh_cn: 可以接受的最小关联程度

source: Advanced Search
zh_cn: 高级查询

# BeginKnowledgeSearch
source: Start knowledge search
zh_cn: 开始知识搜索

# BeginKnowledgeSearchDescription
source: Enter the query content and start searching immediately
zh_cn: 输入查询内容，即刻开始查找

source: Full content
zh_cn: 完整内容

source: Generate answer
zh_cn: 生成回答

# KnowledgeBaseDescriptionPlaceholderText
source: Briefly describe the knowledge base
zh_cn: 简要描述该知识库

source: Quick Q&A
zh_cn: 快速问答

# NeedAdmin
source: Requires admin privileges
zh_cn: 需要管理员权限

# NeedAdminDescription
source: The operation you are about to perform requires administrator privileges, please restart the application in administrator mode
zh_cn: 你将要执行的操作需要管理员权限，请用管理员模式重启应用

source: Copy content
zh_cn: 复制内容

source: Exit
zh_cn: 退出

# ExitAppDescription
source: You can also choose to keep the app running in the background for quick switching back. You can exit the app at any time from the system tray.
zh_cn: 你也可以选择隐藏应用，并在需要时快速切回来。你可以随时在系统托盘中退出应用

# ExitAppTitle
source: Exit the app?
zh_cn: 退出应用？

source: Hide
zh_cn: 隐藏

# NeverAskMeAgain
source: Do not ask me again
zh_cn: 不再询问我

source: Feature
zh_cn: 功能

# HideWhenClose
source: Hide on close
zh_cn: 关闭时隐藏

# HideWhenCloseDescription
source: Hide application when closing window instead of quitting
zh_cn: 关闭窗口时隐藏应用而非退出

source: Tip
zh_cn: 提示

# MessageUseMarkdown
source: Render messages using Markdown
zh_cn: 使用 Markdown 渲染消息

# MessageUseMarkdownDescription
source: Conversation messages will render Markdown, but there are still some experience issues
zh_cn: 对话消息将对 Markdown 进行渲染，但目前仍有一些体验上的问题
